cherry-embedded/CherryUSB/port/imxrt/usb_dc_imxrt.c
    /* Disable setup lockout, please refer to "Control Endpoint Operation" section in RM. */
    ehciState->registerBase->USBMODE |= USBHS_USBMODE_SLOM_MASK;

/* Set the endian by using CPU's endian */
#if (ENDIANNESS == USB_BIG_ENDIAN)
    ehciState->registerBase->USBMODE |= USBHS_USBMODE_ES_MASK;
#else
    ehciState->registerBase->USBMODE &= ~USBHS_USBMODE_ES_MASK;
#endif
    /* Initialize the QHs of endpoint. */
    for (uint32_t i = 0U; i < (USB_DEVICE_ENDPOINTS * 2U); i++)
    {
        ehciState->qh[i].nextDtdPointer = USB_DEVICE_ECHI_DTD_TERMINATE_MASK;
        ehciState->qh[i].capabilttiesCharacteristicsUnion.capabilttiesCharacteristicsBitmap.maxPacketSize =
            USB_CTRL_EP_MPS;
        ehciState->dtdHead[i]                                              = NULL;
        ehciState->dtdTail[i]                                              = NULL;
        ehciState->qh[i].endpointStatusUnion.endpointStatusBitmap.isOpened = 0U;
    }

    /* Add QH buffer address to USBHS_EPLISTADDR_REG */
    ehciState->registerBase->EPLISTADDR = (uint32_t)ehciState->qh;

    /* Clear device address */
    ehciState->registerBase->DEVICEADDR = 0U;

#if defined(USB_DEVICE_CONFIG_DETACH_ENABLE) && (USB_DEVICE_CONFIG_DETACH_ENABLE > 0U)
    ehciState->registerBase->OTGSC = ehciState->registerBase->OTGSC & 0x0000FFFFU;
    ehciState->registerBase->OTGSC |= USBHS_OTGSC_BSVIE_MASK;
#endif /* USB_DEVICE_CONFIG_DETACH_ENABLE */

    /* Enable USB Interrupt, USB Error Interrupt, Port Change detect Interrupt, USB-Reset Interrupt*/
    ehciState->registerBase->USBINTR =
        (USBHS_USBINTR_UE_MASK | USBHS_USBINTR_UEE_MASK | USBHS_USBINTR_PCE_MASK | USBHS_USBINTR_URE_MASK
#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
         | USBHS_USBINTR_SLE_MASK
#endif /* USB_DEVICE_CONFIG_LOW_POWER_MODE */
        );

    /* Clear reset flag */
    ehciState->isResetting = 0U;
}

static void usb_device_set_prime(usb_device_ehci_state_struct_t *ehciState, uint8_t ep)
{
    uint32_t index = USB_GET_INDEX(ep);
    uint32_t primeBit;
    usb_device_ehci_dtd_struct_t *currentDtd;
    /* Get the next in-used dtd */
    currentDtd = (usb_device_ehci_dtd_struct_t *)((uint32_t)ehciState->dtdHead[index] &
                                                    USB_DEVICE_ECHI_DTD_POINTER_MASK);

    if ((NULL != currentDtd) && (0U != (currentDtd->dtdTokenUnion.dtdTokenBitmap.status &
                                        USB_DEVICE_ECHI_DTD_STATUS_ACTIVE)))
    {   
        primeBit = USB_GET_PRIMEBIT(ep);

        /* Try to prime the next dtd. */
        ehciState->registerBase->EPPRIME = primeBit;

        /* Whether the endpoint transmit/receive buffer is ready or not. If not, wait for prime bit
            * cleared and prime the next dtd. */
        if (0U == (ehciState->registerBase->EPSR & primeBit))
        {
            /* Wait for the endpoint prime bit cleared by HW */
            while (0U != (ehciState->registerBase->EPPRIME & primeBit))
            {
            }

            /* If the endpoint transmit/receive buffer is not ready */
            if (0U == (ehciState->registerBase->EPSR & primeBit))
            {
                /* Prime next dtd and prime the transfer */
                ehciState->qh[index].nextDtdPointer         = (uint32_t)currentDtd;
                ehciState->qh[index].dtdTokenUnion.dtdToken = 0U;
                ehciState->registerBase->EPPRIME            = primeBit;
            }
        }
    }
}

/***********************************usb dc func**********************************************/
#if CONFIG_USB_HS
/* pointer to high speed mode descriptor */
uint8_t *USB_Descriptor_HS = 0;

void usbd_desc_hs_register(uint8_t *descriptor)
{
    if(descriptor)
    {
        USB_Descriptor_HS = descriptor;
    }
}
#endif

int usb_dtd_buf_init(uint8_t instance)
{
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[instance];
    for(int i = 0; i < USB_DEVICE_MAX_DTD; i++)
    {
        ptr[i].sta = 0;
        ptr[i].pbuf = 0;
        ptr[i].mps = 0;
    }

    return 0;
}

uint8_t usb_dtd_buf_set_manual(uint8_t ep)
{
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[0];
    uint32_t index = USB_GET_INDEX(ep);

    ptr[index].type = 2;

    return 0;
}

int usb_transfer_data(uint8_t ep, uint8_t *data, uint16_t len)
{
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[0];
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];
    uint32_t index = USB_GET_INDEX(ep);
    uint8_t *pdata = data;

    switch (ptr[index].type)
    {
    case 1:
        if((ptr[index].sta != 1) || (len > ptr[index].mps))
        {
            return -1;
        }

        pdata = ptr[index].pbuf;
        for(int i = 0; i < len; i++)
        {
            pdata[i] = data[i];
        }
    case 2:
        if(USB_DeviceEhciTransfer(ehciState, ep, pdata, len) != kStatus_USB_Success)
        {
            return -1;
        }
        break;
    default:
        return -1;
    }

    
    return 0;
}

void usb_connect(uint8_t instance, uint8_t ctrl)
{
    IRQn_Type irqNum;
    USB_Type *pdevice = g_UsbDeviceEhciState[instance].registerBase;

    if(instance == 0)
    {
        irqNum = USB_OTG1_IRQn;
    }
    else
    {
        irqNum = USB_OTG2_IRQn;
    }

    if(ctrl)
    {
        /* Install isr, set priority, and enable IRQ. */
        NVIC_SetPriority((IRQn_Type)irqNum, 3);
        EnableIRQ((IRQn_Type)irqNum);

        pdevice->USBCMD |= USBHS_USBCMD_RS_MASK;
    }
    else
    {
        pdevice->USBCMD &= ~USBHS_USBCMD_RS_MASK;
        DisableIRQ((IRQn_Type)irqNum);
    }
}

static uint8_t usb_device_init(uint8_t instance)
{
    USB_Type *pdevice;
    usb_device_ehci_state_struct_t *ehciState = NULL;

    if(instance == 0)
    {
        ehciState = &g_UsbDeviceEhciState[instance];
        ehciState->controllerId = 1;
        ehciState->qh = (usb_device_ehci_qh_struct_t *)&qh_buffer[instance * 2048];
        ehciState->dtd = s_UsbDeviceEhciDtd[instance];
        ehciState->registerBase = USB1;
    #if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
        ehciState->registerPhyBase = USBPHY1;
    #if (defined(FSL_FEATURE_SOC_USBNC_COUNT) && (FSL_FEATURE_SOC_USBNC_COUNT > 0U))
        ehciState->registerNcBase = USBNC1;
    #endif
    #endif
    }
    else
    {
        return 1;
    }

    pdevice = ehciState->registerBase;

    /* Reset the controller. */
    pdevice->USBCMD |= USBHS_USBCMD_RST_MASK;
    while (0U != (pdevice->USBCMD & USBHS_USBCMD_RST_MASK))
    {
    }
    /* Get the HW's endpoint count */
    ehciState->endpointCount =
        (uint8_t)((pdevice->DCCPARAMS & USB_DCCPARAMS_DEN_MASK) >> USB_DCCPARAMS_DEN_SHIFT);
    if(ehciState->endpointCount != USB_DEVICE_ENDPOINTS)
    {
        return 1;
    }
    /* Clear the controller mode field and set to device mode. */
    pdevice->USBMODE &= ~USBHS_USBMODE_CM_MASK;
    pdevice->USBMODE |= USBHS_USBMODE_CM(0x02U) | USB_USBMODE_SLOM(0x01);

#ifndef CONFIG_USB_HS
    pdevice->PORTSC1 |= (0x01u << 24);  //fixed full-speed
#endif // !CONFIG_USB_HS

    /* Set the EHCI to default status. */
    USB_DeviceEhciSetDefaultState(ehciState);

