cherry-embedded/CherryUSB/port/imxrt/usb_dc_imxrt.c
    return 0;
}

static uint8_t usb_device_deinit(uint8_t instance)
{
    USB_Type *pdevice;
    usb_device_ehci_state_struct_t *ehciState = NULL;
    if(instance == 1)
    {
        ehciState = &g_UsbDeviceEhciState[instance];
        pdevice = ehciState->registerBase;
    }
    else
    {
        return 1;
    }

    /* Disable all interrupt. */
    pdevice->USBINTR = 0U;
    /* Stop the device functionality. */
    pdevice->USBCMD &= ~USBHS_USBCMD_RS_MASK;
    /* Reset the controller. */
    pdevice->USBCMD |= USBHS_USBCMD_RST_MASK;

    usb_connect(instance, 0);

    return 0;
}

int usb_dc_init(void)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    memset(ehciState, 0, sizeof(usb_device_ehci_state_struct_t));

    usb_clock_init(0);
    usb_device_deinit(0);
    usb_device_init(0);
    usb_dtd_buf_init(0);

    usb_connect(0, 1);
    return 0;
}

int usbd_set_address(const uint8_t addr)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];
    if(addr)
    {
        /* set address after IN transaction */
        ehciState->registerBase->DEVICEADDR = (((uint32_t)addr << USB_DEVICEADDR_USBADR_SHIFT) | USB_DEVICEADDR_USBADRA_MASK);
    }
    else
    {
        /* immediately set address */
        ehciState->registerBase->DEVICEADDR = (uint32_t)addr << USB_DEVICEADDR_USBADR_SHIFT;
    }

#if CONFIG_USB_HS
    if((ehciState->speed == USB_SPEED_HIGH) && USB_Descriptor_HS)
    {
        /* set descriptor to high speed */
        usbd_desc_register(USB_Descriptor_HS);
    }
#endif
    
    return 0;
}

int usbd_ep_open(const struct usbd_endpoint_cfg *ep_cfg)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];
    usb_device_endpoint_init_struct_t epConfig;
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[0];
    uint32_t index = USB_GET_INDEX(ep_cfg->ep_addr);

    epConfig.endpointAddress = ep_cfg->ep_addr;
    epConfig.maxPacketSize = ep_cfg->ep_mps;
    epConfig.transferType = ep_cfg->ep_type;
    epConfig.zlt = 0;
    epConfig.interval = 0;

    if(kStatus_USB_Success != USB_DeviceEhciEndpointDeinit(ehciState, ep_cfg->ep_addr))
    {
        return -1;
    }

    if(USB_DeviceEhciEndpointInit(ehciState, &epConfig) != kStatus_USB_Success)
    {
        return -1;
    }

    if(ptr[index].type == 0)
    {
        if(ptr[index].pbuf == 0)
        {
            ptr[index].pbuf = malloc(ep_cfg->ep_mps);
            if(ptr[index].pbuf == 0)
            {
                return -1;
            }
            ptr[index].mps = ep_cfg->ep_mps;
            ptr[index].type = 1; /* set to auto mode */
            ptr[index].sta = 1; /* ready */
        }
    }

    if((ptr[index].type == 1) && (ep_cfg->ep_addr != USB_CONTROL_OUT_EP0))
    {
        /* is auto */
        if(USB_EP_DIR_IS_OUT(ep_cfg->ep_addr))
        {
            if(USB_DeviceEhciTransfer(ehciState, ep_cfg->ep_addr, ptr[index].pbuf, ptr[index].mps) != kStatus_USB_Success)
            {
                return -1;
            }
            ptr[index].sta = 2; /* using */
        }
    }

    return 0;
}

int usbd_ep_close(const uint8_t ep)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    if(USB_DeviceEhciEndpointDeinit(ehciState, ep) != kStatus_USB_Success)
    {
        return -1;
    }
    return 0;
}

int usbd_ep_set_stall(const uint8_t ep)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    if(USB_DeviceEhciEndpointStall(ehciState, ep) != kStatus_USB_Success)
    {
        return -1;
    }
    return 0;
}

int usbd_ep_clear_stall(const uint8_t ep)
{
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    if(USB_DeviceEhciEndpointUnstall(ehciState, ep) != kStatus_USB_Success)
    {
        return -1;
    }
    return 0;
}

int usbd_ep_is_stalled(const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint8_t ep_dir = USB_EP_GET_DIR(ep);
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    if(ep_idx == 0)
    {
        if(ep_dir)
        {
            *stalled = (ehciState->registerBase->ENDPTCTRL0 & 0x00000001) ? 1 : 0;
        }
        else
        {
            *stalled = (ehciState->registerBase->ENDPTCTRL0 & 0x00010000) ? 1 : 0;
        }
    }
    else
    {
        if(ep_dir)
        {
            *stalled = (ehciState->registerBase->ENDPTCTRL[ep_idx - 1] & 0x00000001) ? 1 : 0;
        }
        else
        {
            *stalled = (ehciState->registerBase->ENDPTCTRL[ep_idx - 1] & 0x00010000) ? 1 : 0;
        }
    }
    return 0;
}

int usbd_ep_write(const uint8_t ep, const uint8_t *data, uint32_t data_len, uint32_t *ret_bytes)
{
    uint8_t *txbuf = NULL;
    uint8_t index = USB_GET_INDEX(ep);
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[0];
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    *ret_bytes = 0;

    switch(ptr[index].type)
    {
        case 1:
            txbuf = ptr[index].pbuf;
            data_len = (data_len > ptr[index].mps) ? ptr[index].mps : data_len;
            for(int i = 0; i < data_len; i++)
            {
                txbuf[i] = data[i];
            }
            break;
        case 2:
            data_len = (data_len > ptr[index].mps) ? ptr[index].mps : data_len;
            txbuf = (uint8_t *)data;
            break;
        default:
            return -1;
    }

    if(USB_DeviceEhciTransfer(ehciState, ep, txbuf, data_len) != kStatus_USB_Success)
    {
        return -1;
    }

    *ret_bytes = data_len;
    return 0;
}

int usbd_ep_read(const uint8_t ep, uint8_t *data, uint32_t max_data_len, uint32_t *read_bytes)
{
    uint8_t index = USB_GET_INDEX(ep);
    usb_dtd_buffer_t *ptr = g_UsbDtdBufList[0];
    uint8_t *temp;
    uint32_t count;
    usb_device_ehci_dtd_struct_t *currentDtd;
    usb_device_ehci_state_struct_t *ehciState = &g_UsbDeviceEhciState[0];

    if (USB_EP_DIR_IS_IN(ep))
    {
        return -1;
    }

    if (!data && max_data_len) {
        return -1;
    }

