cherry-embedded/CherryUSB/port/imxrt/usb_dc_imxrt.c
    if (!max_data_len) {
        return 0;
    }

    if((ep == USB_CONTROL_OUT_EP0) && (max_data_len == 8) && !read_bytes) /* is read setup packet */
    {
        /* Cancel the data phase transfer */
        USB_DeviceEhciCancelControlPipe(ehciState, index);
        /* Cancel the status phase transfer */
        USB_DeviceEhciCancelControlPipe(ehciState, index);
        USB_DeviceEhciGetSetupData(ehciState, index, data);

        struct usb_setup_packet *setup = (struct usb_setup_packet *)data;

        if(setup->bmRequestType & USB_REQUEST_DIR_IN)
        {
            /* is in */
            if(USB_DeviceEhciTransfer(ehciState, USB_CONTROL_OUT_EP0, ptr[index].pbuf, 0) != kStatus_USB_Success)
            {
                return -2;
            }
        }
        else
        {
            /* is out */
            if(setup->wLength)
            {
                if(setup->wLength > ptr[index].mps)
                {
                    if(ptr[index].pbuf != NULL)
                    {
                        usb_free(ptr[index].pbuf);
                    }
                    ptr[index].mps = setup->wLength;
                    ptr[index].pbuf = usb_malloc(setup->wLength);
                }
                if(!ptr[index].pbuf)
                {
                    return -3;
                }
                if(USB_DeviceEhciTransfer(ehciState, USB_CONTROL_OUT_EP0, ptr[index].pbuf, setup->wLength) != kStatus_USB_Success)
                {
                    return -4;
                }
                ptr[index].sta = 2; /* using */
            }
        }
    }
    else
    {
        currentDtd = ehciState->dtdHead[index];
        if (NULL != currentDtd)
        {
            /* Don't handle the active dtd. */
            if ((0U == (currentDtd->dtdTokenUnion.dtdTokenBitmap.status & USB_DEVICE_ECHI_DTD_STATUS_ACTIVE)) &&
                (0U != currentDtd->dtdTokenUnion.dtdTokenBitmap.ioc))
            {
                count = (currentDtd->reservedUnion.originalBufferInfo.originalBufferLength -
                                            currentDtd->dtdTokenUnion.dtdTokenBitmap.totalBytes);
                count = (count <= max_data_len) ? count : max_data_len;
                temp = (uint8_t *)((currentDtd->bufferPointerPage[0] & USB_DEVICE_ECHI_DTD_PAGE_MASK) |
                                    (currentDtd->reservedUnion.originalBufferInfo.originalBufferOffest));
                /* Save the transfer buffer address */
                if(data != NULL)
                {
                    if(ptr[index].type == 1)
                    {
                        for(int i = 0; i < count; i++)
                        {
                            *data = temp[i];
                            data++;
                        }
                    }
                    else if(ptr[index].type == 2)
                    {
                        data = temp;
                    }
                }
                /* Save the transferred data length */
                if (read_bytes)
                {
                    *read_bytes = count;
                }

                /* Move the dtd queue head pointer to next */
                if (ehciState->dtdHead[index] == ehciState->dtdTail[index])
                {
                    ehciState->dtdHead[index]                   = NULL;
                    ehciState->dtdTail[index]                   = NULL;
                    ehciState->qh[index].nextDtdPointer         = USB_DEVICE_ECHI_DTD_TERMINATE_MASK;
                    ehciState->qh[index].dtdTokenUnion.dtdToken = 0U;
                }
                else
                {
                    ehciState->dtdHead[index] =
                        (usb_device_ehci_dtd_struct_t *)ehciState->dtdHead[index]->nextDtdPointer;
                }

                /* Clear the token field of the dtd */
                currentDtd->dtdTokenUnion.dtdToken = 0U;
                currentDtd->nextDtdPointer         = (uint32_t)ehciState->dtdFree;
                ehciState->dtdFree                 = currentDtd;
                ehciState->dtdCount++;

                if(USB_EP_GET_IDX(ep) && (ptr[index].type == 1))  /* if not ep0 */
                {
                    if(USB_DeviceEhciTransfer(ehciState, ep, ptr[index].pbuf, ptr[index].mps) != kStatus_USB_Success)
                    {
                        return -5;
                    }
                    ptr[index].sta = 2; /* using */
                }
            }
            else
            {
                *read_bytes = 0;
                return 0;
            }
        }
        else
        {
            return -6;
        }
    }

    return 0;
}

void usb_device_isr_func(usb_device_ehci_state_struct_t *ehciState)
{
    USB_Type *device = ehciState->registerBase;
    usb_device_ehci_dtd_struct_t *currentDtd;
    uint8_t index = 0;
    uint32_t int_stat;
    uint32_t ep_setup_stat;
    uint32_t ep_int_stat;
    uint8_t endpoint;

#if ((defined(USB_DEVICE_CONFIG_LOW_POWER_MODE)) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
    USBNC_Type *usbnc = p->registerNcBase;
    if (0U != (usbnc->USB_OTGn_CTRL & USBNC_USB_OTGn_CTRL_WIE_MASK))
    {
        if (0U != (usbnc->USB_OTGn_CTRL & USBNC_USB_OTGn_CTRL_WIR_MASK))
        {
            usbnc->PORTSC1 &= ~USBHS_PORTSC1_PHCD_MASK;
            usbnc->USB_OTGn_CTRL &= ~USBNC_USB_OTGn_CTRL_WIE_MASK;
        }
    }
    else
    {
    }
#endif

    int_stat = device->USBSTS;
    int_stat &= device->USBINTR;

    device->USBSTS = int_stat;

#if defined(USB_DEVICE_CONFIG_ERROR_HANDLING) && (USB_DEVICE_CONFIG_ERROR_HANDLING > 0U)
    if (0U != (status & USBHS_USBSTS_UEI_MASK))
    {
        /* Error interrupt */
        // USB_DeviceEhciInterruptError(ehciState);
    }
#endif /* USB_DEVICE_CONFIG_ERROR_HANDLING */

    if (0U != (int_stat & USBHS_USBSTS_URI_MASK))
    {
        /* Reset interrupt */
        uint32_t status = 0U;

        /* Clear the setup flag */
        status                             = ehciState->registerBase->EPSETUPSR;
        ehciState->registerBase->EPSETUPSR = status;
        /* Clear the endpoint complete flag */
        status                              = ehciState->registerBase->EPCOMPLETE;
        ehciState->registerBase->EPCOMPLETE = status;

        do
        {
            /* Flush the pending transfers */
            ehciState->registerBase->EPFLUSH = USBHS_EPFLUSH_FERB_MASK | USBHS_EPFLUSH_FETB_MASK;
        } while (0U != (ehciState->registerBase->EPPRIME & (USBHS_EPPRIME_PERB_MASK | USBHS_EPPRIME_PETB_MASK)));

        /* Whether is the port reset. If yes, set the isResetting flag. Or, notify the up layer. */
        if (0U != (ehciState->registerBase->PORTSC1 & USBHS_PORTSC1_PR_MASK))
        {
            ehciState->isResetting = 1U;
        }
        else
        {
            USB_DeviceEhciSetDefaultState(ehciState);
            usbd_event_notify_handler(USBD_EVENT_RESET, NULL);
        }
    }

