cherry-embedded/CherryUSB/port/imxrt/usb_dc_imxrt.c
    if (0U != (int_stat & USBHS_USBSTS_UI_MASK))
    {
        /* Token done interrupt */
        /* Get the EPSETUPSR to check the setup packect received in which one endpoint. */
        ep_setup_stat = device->ENDPTSETUPSTAT;

        if(ep_setup_stat != 0)
        {
            /* read setup data */
            for (endpoint = 0U; endpoint < USB_DEVICE_ENDPOINTS; endpoint++)
            {
                if (0U != (ep_setup_stat & (1UL << endpoint)))
                {
                    usbd_event_notify_handler(USBD_EVENT_SETUP_NOTIFY, NULL);
                }
            }
        }
        /* Read the USBHS_EPCOMPLETE_REG to get the endpoint transfer done status */
        ep_int_stat = device->ENDPTCOMPLETE;
        /* Clear the endpoint transfer done status */
        device->ENDPTCOMPLETE = ep_int_stat;
        if (0U != ep_int_stat)
        {
            for (uint8_t endpoint = 0U; endpoint < 8; endpoint++)
            {
                volatile uint32_t tmp = (0x00010001UL << endpoint);
                /* Check the transfer is done or not in the specified endpoint. */
                if (ep_int_stat & tmp)
                {
                    if(ep_int_stat & 0x0000FFFFu)
                    {
                        /* out int */
                        index = endpoint << 1;
                        
                        if(endpoint == 0) /* is ep0 */
                        {
                            usbd_event_notify_handler(USBD_EVENT_EP0_OUT_NOTIFY, NULL);
                        }
                        else
                        {
                            usbd_event_notify_handler(USBD_EVENT_EP_OUT_NOTIFY, (void *)USB_ENDPOINT_OUT(endpoint));
                        }
                    }

                    if(ep_int_stat & 0xFFFF0000u)
                    {
                        /* in int */
                        index = (endpoint << 1) + 1;

                        /* Get the in-used dtd of the specified endpoint. */
                        currentDtd = (usb_device_ehci_dtd_struct_t *)((uint32_t)ehciState->dtdHead[index] &
                                                                                USB_DEVICE_ECHI_DTD_POINTER_MASK);
                        
                        /* Don't handle the active dtd. */
                        if ((0U == (currentDtd->dtdTokenUnion.dtdTokenBitmap.status & USB_DEVICE_ECHI_DTD_STATUS_ACTIVE)) &&
                            (0U != currentDtd->dtdTokenUnion.dtdTokenBitmap.ioc))
                        {
                            /* Move the dtd queue head pointer to next */
                            if (ehciState->dtdHead[index] == ehciState->dtdTail[index])
                            {
                                ehciState->dtdHead[index]                   = NULL;
                                ehciState->dtdTail[index]                   = NULL;
                                ehciState->qh[index].nextDtdPointer         = USB_DEVICE_ECHI_DTD_TERMINATE_MASK;
                                ehciState->qh[index].dtdTokenUnion.dtdToken = 0U;
                            }
                            else
                            {
                                ehciState->dtdHead[index] =
                                    (usb_device_ehci_dtd_struct_t *)ehciState->dtdHead[index]->nextDtdPointer;
                            }

                            /* Clear the token field of the dtd */
                            currentDtd->dtdTokenUnion.dtdToken = 0U;
                            currentDtd->nextDtdPointer         = (uint32_t)ehciState->dtdFree;
                            ehciState->dtdFree                 = currentDtd;
                            ehciState->dtdCount++;
                        }
                        
                        if(endpoint == 0)  /* is ep0 */
                        {
                            usbd_event_notify_handler(USBD_EVENT_EP0_IN_NOTIFY, NULL);
                        }
                        else
                        {
                            usbd_event_notify_handler(USBD_EVENT_EP_IN_NOTIFY, (void *)USB_ENDPOINT_IN(endpoint));
                        }
                    }
                }
            }
        }
    }

    if (0U != (int_stat & USBHS_USBSTS_PCI_MASK))
    {
        /* Port status change interrupt */
        /* Whether the port is doing reset. */
        if (0U == (device->PORTSC1 & USBHS_PORTSC1_PR_MASK))
        {
            /* If not, update the USB speed. */
            if (0U != (device->PORTSC1 & USBHS_PORTSC1_HSP_MASK))
            {
                ehciState->speed = USB_SPEED_HIGH;
            }
            else
            {
                ehciState->speed = USB_SPEED_FULL;
            }

            /* If the device reset flag is non-zero, notify the up layer the device reset finished. */
            if (0U != ehciState->isResetting)
            {
                USB_DeviceEhciSetDefaultState(ehciState);
                usbd_event_notify_handler(USBD_EVENT_RESET, NULL);
                ehciState->isResetting = 0U;
            }
        }

#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
        if ((0U != ehciState->isSuspending) && (0U == (device->PORTSC1 & USB_PORTSC1_SUSP_MASK)))
        {
            /* Set the resume flag */
            ehciState->isSuspending = 0U;
            usbd_event_notify_handler(USBD_EVENT_RESUME, NULL);
        }
#endif /* USB_DEVICE_CONFIG_LOW_POWER_MODE */
        }
#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
    if (0U != (int_stat & USBHS_USBSTS_SLI_MASK))
    {
        /* Suspend interrupt */
        // USB_DeviceEhciInterruptSuspend(ehciState);
        usbd_event_notify_handler(USBD_EVENT_SUSPEND, NULL);
    }
#endif /* USB_DEVICE_CONFIG_LOW_POWER_MODE */

    if (0U != (int_stat & USBHS_USBSTS_SRI_MASK))
    {
        /* Sof interrupt */
        // USB_DeviceEhciInterruptSof(int_stat);
        usbd_event_notify_handler(USBD_EVENT_SOF, NULL);
    }
}

void USB_OTG1_IRQHandler(void)
{
    usb_device_isr_func(&g_UsbDeviceEhciState[0]);
    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
    exception return operation might vector to incorrect interrupt */
    __DSB();
}

void USB_OTG2_IRQHandler(void)
{
    usb_device_isr_func(&g_UsbDeviceEhciState[1]);
    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
    exception return operation might vector to incorrect interrupt */
    __DSB();
}
